In [1]:
import pandas as pd

In [2]:
people = {
    "first_name":['amir','alif','kunal','ayesha','sushmita'],
    "last_name":['nadaf','kamate','chavan','shaikh','teli'],
    "age":[23,21,24,22,22]    
}

df = pd.DataFrame(people)

In [3]:
df

  first_name last_name  age
0       amir     nadaf   23
1       alif    kamate   21
2      kunal    chavan   24
3     ayesha    shaikh   22
4   sushmita      teli   22

## lets create a new column holding the same value as per the first_name and the last_name

In [7]:
df['first_name'] + ' ' + df['last_name']

0       amir nadaf
1      alif kamate
2     kunal chavan
3    ayesha shaikh
4    sushmita teli
dtype: object

In [8]:
df['full_name'] = df['first_name'] + " " + df['last_name']

In [9]:
df

  first_name last_name  age      full_name
0       amir     nadaf   23     amir nadaf
1       alif    kamate   21    alif kamate
2      kunal    chavan   24   kunal chavan
3     ayesha    shaikh   22  ayesha shaikh
4   sushmita      teli   22  sushmita teli

# Removing columns

In [12]:
df.drop(columns=['first_name','last_name'], inplace=True)

In [13]:
df

   age      full_name
0   23     amir nadaf
1   21    alif kamate
2   24   kunal chavan
3   22  ayesha shaikh
4   22  sushmita teli

In [15]:
df['full_name'].str.split(" ", expand=True)

          0       1
0      amir   nadaf
1      alif  kamate
2     kunal  chavan
3    ayesha  shaikh
4  sushmita    teli

In [16]:
df[['first_name','last_name']] = df['full_name'].str.split(" ", expand=True)

In [17]:
df

   age      full_name first_name last_name
0   23     amir nadaf       amir     nadaf
1   21    alif kamate       alif    kamate
2   24   kunal chavan      kunal    chavan
3   22  ayesha shaikh     ayesha    shaikh
4   22  sushmita teli   sushmita      teli

# Adding single Row

In [38]:
new_row = {'first_name':'aishwariya'}
# Append the new row
df = df.append(new_row, ignore_index=True)
df.append({'first_name':'aishwariya'})

# not happening giving an a error

AttributeError: 'DataFrame' object has no attribute 'append'

In [40]:
people2 = {
    "first_name":['tony','steve'],
    "last_name":['starks','rogers'],
    "email":['ironman@avenger.com','cap@avenge.com']
}
df2 = pd.DataFrame(people2)

In [41]:
df.append(df2,ignore_index=True)

AttributeError: 'DataFrame' object has no attribute 'append'